## SQL习题练习

学生表 Student

In [ ]:
1.学生表
Student(SId,Sname,Sage,Ssex)
--SId 学生编号,Sname 学生姓名,Sage 出生年月,Ssex 学生性别

create table Student(SId varchar(10),Sname varchar(10),Sage datetime,Ssex varchar(10));
insert into Student values('01' , '赵雷' , '1990-01-01' , '男');
insert into Student values('02' , '钱电' , '1990-12-21' , '男');
insert into Student values('03' , '孙风' , '1990-12-20' , '男');
insert into Student values('04' , '李云' , '1990-12-06' , '男');
insert into Student values('05' , '周梅' , '1991-12-01' , '女');
insert into Student values('06' , '吴兰' , '1992-01-01' , '女');
insert into Student values('07' , '郑竹' , '1989-01-01' , '女');
insert into Student values('09' , '张三' , '2017-12-20' , '女');
insert into Student values('10' , '李四' , '2017-12-25' , '女');
insert into Student values('11' , '李四' , '2012-06-06' , '女');
insert into Student values('12' , '赵六' , '2013-06-13' , '女');
insert into Student values('13' , '孙七' , '2014-06-01' , '女');

科目表 Course

In [ ]:
2.课程表
Course(CId,Cname,TId)
--CId 课程编号,Cname 课程名称,TId 教师编号

In [ ]:
create table Course(CId varchar(10),Cname nvarchar(10),TId varchar(10));
insert into Course values('01' , '语文' , '02');
insert into Course values('02' , '数学' , '01');
insert into Course values('03' , '英语' , '03');

教师表 Teacher

In [ ]:
3.教师表
Teacher(TId,Tname)
--TId 教师编号,Tname 教师姓名

In [ ]:
create table Teacher(TId varchar(10),Tname varchar(10));
insert into Teacher values('01' , '张三');
insert into Teacher values('02' , '李四');
insert into Teacher values('03' , '王五');

成绩表 SC

In [ ]:
4.成绩表
SC(SId,CId,score)
--SId 学生编号,CId 课程编号,score 分数

In [ ]:
create table SC(SId varchar(10),CId varchar(10),score decimal(18,1));
insert into SC values('01' , '01' , 80);
insert into SC values('01' , '02' , 90);
insert into SC values('01' , '03' , 99);
insert into SC values('02' , '01' , 70);
insert into SC values('02' , '02' , 60);
insert into SC values('02' , '03' , 80);
insert into SC values('03' , '01' , 80);
insert into SC values('03' , '02' , 80);
insert into SC values('03' , '03' , 80);
insert into SC values('04' , '01' , 50);
insert into SC values('04' , '02' , 30);
insert into SC values('04' , '03' , 20);
insert into SC values('05' , '01' , 76);
insert into SC values('05' , '02' , 87);
insert into SC values('06' , '01' , 31);
insert into SC values('06' , '03' , 34);
insert into SC values('07' , '02' , 89);
insert into SC values('07' , '03' , 98);

### 练习题目

1.查询" 01 "课程比" 02 "课程成绩高的学生的信息及课程分数

因为需要全部的学生信息，则需要在sc表中得到符合条件的SId后与student表进行join，可以left join 也可以 right join

In [ ]:
select * from Student right join (
select t1.Sld, class1, class2 from
(select Sld, score as class1 from SC where SC.Cld = '01') as t1,
(select Sld, score as class2 from SC where SC.Cld = '02') as t2
where t1.Sld = t2.Sld and t1.class1 > t2.class2
) as r
on Student.Sld = r.Sld;

In [ ]:
select * from  (
    select t1.SId, class1, class2 
    from
        (SELECT SId, score as class1 FROM sc WHERE sc.CId = '01') AS t1, 
        (SELECT SId, score as class2 FROM sc WHERE sc.CId = '02') AS t2
    where t1.SId = t2.SId and t1.class1 > t2.class2
) r 
LEFT JOIN Student
ON Student.SId = r.SId;

1.1 查询同时存在" 01 "课程和" 02 "课程的情况

In [ ]:
select * from 
(select * from sc where sc.Cld = '01') as t1,
(select * from sc where sc.Cld = '02') as t2
where t1.Sld = t2.Sld;

1.2 查询存在" 01 "课程但可能不存在" 02 "课程的情况(不存在时显示为 null )

这一道就是明显需要使用join的情况了，02可能不存在，即为left join的右侧或right join 的左侧即可.

In [ ]:
select * 
from (select * from sc where sc.Cld = '01') as t1
left join (select * from sc where sc.Cld = '02') as t2
on t1.Sld = t2.Sld;

In [ ]:
select * from 
(select * from sc where sc.CId = '02') as t2
right join 
(select * from sc where sc.CId = '01') as t1
on t1.SId = t2.SId;

1.3 查询不存在" 01 "课程但存在" 02 "课程的情况

In [ ]:
select * from 
(select * from sc where sc.Cld = '02') as t2
left join 
(select * from sc where sc.Cld = '01') as t1
on t2.Sld = t1.Sld
where t1.Sld is null;

In [ ]:
select * from sc
where sc.sld not in (select * from sc where sc.cld = '01')
and sc.cld = '02';

2.查询平均成绩大于等于 60 分的同学的学生编号和学生姓名和平均成绩

这里只用根据学生ID把成绩分组，对分组中的score求平均值，最后在选取结果中AVG大于60的即可. 注意，这里必须要给计算得到的AVG结果一个alias.（AS ss）
得到学生信息的时候既可以用join也可以用一般的联合搜索

In [ ]:
select s.sld, s.sname, r.avgscore from student as s
right join (
    select sld, avg(score) as avgscore 
    from sc 
    group by sld 
    having avg(score)>=60) as r
on s.sld = r.sld;

In [ ]:
select s.sld,s.sname,r.avgscore
from student as s,(select sld,avg(score) from sc group by sld having avg(score)>=60) as r
where s.sld = r.sld;

查询在 SC 表存在成绩的学生信息